results/run-baseline.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: script.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 1 iterations for each of 1 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 1 VUs  00m01.0s/10m0s  0/1 iters, 1 per VU

running (00m02.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 1 VUs  00m02.0s/10m0s  0/1 iters, 1 per VU

running (00m03.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 1 VUs  00m03.0s/10m0s  0/1 iters, 1 per VU


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<406.08' p(95)=228.17ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 1       0.330974/s
    checks_succeeded...: 100.00% 1 out of 1
    checks_failed......: 0.00%   0 out of 1

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=226.76ms min=225.19ms med=226.76ms max=228.33ms p(90)=228.01ms p(95)=228.17ms
      { expected_response:true }...: avg=226.76ms min=225.19ms med=226.76ms max=228.33ms p(90)=228.01ms p(95)=228.17ms
    http_req_failed................: 0.00%  0 out of 2
    http_reqs......................: 2      0.661948/s

    EXECUTION
    iteration_duration.............: avg=3.02s    min=3.02s    med=3.02s    max=3.02s    p(90)=3.02s    p(95)=3.02s   
    iterations.....................: 1      0.330974/s
    vus............................: 1      min=1      max=1
    vus_max........................: 1      min=1      max=1

    NETWORK
    data_received..................: 14 kB  4.5 kB/s
    data_sent......................: 3.6 kB 1.2 kB/s



running (00m03.0s), 0/1 VUs, 1 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs  00m03.0s/10m0s  1/1 iters, 1 per VU