results/run-baseline.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: script.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 1 iterations for each of 1 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 1 VUs  00m01.0s/10m0s  0/1 iters, 1 per VU

running (00m02.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 1 VUs  00m02.0s/10m0s  0/1 iters, 1 per VU


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<406.08' p(95)=282.41ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 1       0.408983/s
    checks_succeeded...: 100.00% 1 out of 1
    checks_failed......: 0.00%   0 out of 1

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=220.99ms min=152.74ms med=220.99ms max=289.24ms p(90)=275.59ms p(95)=282.41ms
      { expected_response:true }...: avg=220.99ms min=152.74ms med=220.99ms max=289.24ms p(90)=275.59ms p(95)=282.41ms
    http_req_failed................: 0.00%  0 out of 2
    http_reqs......................: 2      0.817966/s

    EXECUTION
    iteration_duration.............: avg=2.44s    min=2.44s    med=2.44s    max=2.44s    p(90)=2.44s    p(95)=2.44s   
    iterations.....................: 1      0.408983/s
    vus............................: 1      min=1      max=1
    vus_max........................: 1      min=1      max=1

    NETWORK
    data_received..................: 14 kB  5.6 kB/s
    data_sent......................: 3.6 kB 1.5 kB/s



running (00m02.4s), 0/1 VUs, 1 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs  00m02.4s/10m0s  1/1 iters, 1 per VU